# 导入streamlit库，用于创建Web应用
import streamlit as st

# 设置页面配置：标题为"音乐播放"，图标为🎵
st.set_page_config(page_title='音乐播放器')

#显示页面主标题
st.title('简易音乐播放器')
# 显示页面文本内容
st.text('使用Streamlit制作的简单音乐播放器，支持切歌和基本播放控制')

# 定义专辑封面图片URL列表
images = [
    # 第一首歌曲的专辑封面
    'https://p1.music.126.net/qKSYMuy9ruRRdVRO8MsONA==/109951172418592653.jpg',
    # 第二首歌曲的专辑封面
    'https://p2.music.126.net/_unjrno3g2ojZ4I6m4MAnQ==/109951172383235131.jpg',
    # 第三首歌曲的专辑封面
    'https://p1.music.126.net/Sycq-TSBOy57___ChEEdyA==/109951172406249431.jpg'
]

# 定义音频文件URL列表
audio_files = [
    # 第一首歌曲的音频文件URL
    'https://music.163.com/song/media/outer/url?id=3327856998.mp3',
    # 第二首歌曲的音频文件URL
    'https://music.163.com/song/media/outer/url?id=3324846858.mp3',
    # 第三首歌曲的音频文件URL
    'https://music.163.com/song/media/outer/url?id=3312521577.mp3'
]

# 定义歌曲名称列表
song_names = [
    # 第一首歌曲名称
    "春予你",
    # 第二首歌曲名称
    "潇洒",
    # 第三首歌曲名称
    "过客"
]

# 定义歌手列表
artists = [
    # 第一首歌曲歌手
    "李嘉格",
    # 第二首歌曲歌手
    "TizzyT / GALI / 马思唯",
    # 第三首歌曲歌手
    "范晓萱 / 100%乐团"
]

# 定义市场列表
song_time = [
    # 第一首歌曲歌手
    "4:01",
    # 第二首歌曲歌手
    "3:33",
    # 第三首歌曲歌手
    "4:58"
]

# 检查session_state中是否存在current_index变量（用于记录当前播放索引）
if 'current_index' not in st.session_state:
    # 如果不存在，初始化为0（从第一首开始）
    st.session_state.current_index = 0

# 从session_state获取当前播放索引
current_index = st.session_state.current_index

# 创建两列布局：第一列显示专辑封面，第二列显示歌曲信息
col1, col2 = st.columns([1,2])


# 在第一列中显示专辑封面
with col1:
    # 显示当前歌曲对应的专辑封面图片，宽度为250像素
    st.image(images[current_index], width=250)

# 在第二列中显示歌曲信息
with col2:
    # 显示歌曲名称（使用header级别）
    st.title(song_names[current_index])
    # 显示歌手信息（使用subheader级别）
    st.text(f"歌手: {artists[current_index]}")
    # 显示歌手信息（使用subheader级别）
    st.text(f"时长: {song_time[current_index]}")

    # 创建两列布局：左边显示为上一首，右边显示为下一首
    col3, col4 = st.columns([2,2])

    # 在第一列中放置"上一首"按钮
    with col3:
        # 当当前索引为0时禁用按钮（已是第一首）
        # 点击按钮时，当前索引减1，然后重新运行应用
        if st.button('上一首', disabled=current_index == 0):
            # 更新session_state中的索引值
            st.session_state.current_index -= 1
            # 重新运行应用以更新界面
            st.rerun()
        

# 在第二列中放置"下一首"按钮
    with col4:
        # 当当前索引为最后一项时禁用按钮（已是最后一首）
        # 点击按钮时，当前索引加1，然后重新运行应用
        if st.button('下一首', disabled=current_index == len(images) - 1):
            # 更新session_state中的索引值
            st.session_state.current_index += 1
            # 重新运行应用以更新界面
            st.rerun()

# 显示音频播放器组件，播放当前索引对应的音频
st.audio(audio_files[current_index])

# 添加水平分隔线
st.divider()




